## Chapter 7 Data Cleaning and Preparation

### 7.1 Handling Missing Data

**Numeric data: Use the floating-point value NaN ( _sentinal value_ )**<br>
**NA data may either be data that does not exist or that exists byt was not observed**<br>
**The built-in Puthon None value is also tearted as NA in object arrays**

### Filtering Out Missing Data
**Filtering in Series**

In [ ]:
from numpy import nan as NA

In [8]:
data=pd.Series([1,NA,3.5,NA,7])

**dropna( ) method**

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

**pandas.notnull( ) + boolean indexing**

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

**Filtering in DataFrame**

In [12]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

**dropna() by default drops any rows containing NA items**

In [14]:
cleaned=data.dropna()

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

**Passing how='all' will only drop rows that are all NA**

In [18]:
data.dropna(how='all')#pass axis=1 to drop columns

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

**To keep certain rows containing specific observations**

In [19]:
df=pd.DataFrame(np.random.randn(7,3))

In [20]:
df

          0         1         2
0 -1.055807  1.347626  0.321551
1 -1.627519 -0.040165 -1.390332
2 -1.421884 -1.235512  0.247866
3 -2.054681  2.726447 -1.126592
4 -1.109623  1.694152  2.155655
5 -1.034601  2.196093 -0.721041
6 -0.193276  1.020094 -0.208693

In [21]:
df.iloc[:4,1]=NA

In [22]:
df.iloc[:2,2]=NA

In [24]:
df.dropna()#drops all rows containing NA values

          0         1         2
4 -1.109623  1.694152  2.155655
5 -1.034601  2.196093 -0.721041
6 -0.193276  1.020094 -0.208693

In [25]:
df.dropna(thresh=2)#only drops rows that have 2 or more NA

          0         1         2
2 -1.421884       NaN  0.247866
3 -2.054681       NaN -1.126592
4 -1.109623  1.694152  2.155655
5 -1.034601  2.196093 -0.721041
6 -0.193276  1.020094 -0.208693

### Filling in Missing Data

**Replacing missing value with a constant**

In [27]:
df.fillna(0)

          0         1         2
0 -1.055807  0.000000  0.000000
1 -1.627519  0.000000  0.000000
2 -1.421884  0.000000  0.247866
3 -2.054681  0.000000 -1.126592
4 -1.109623  1.694152  2.155655
5 -1.034601  2.196093 -0.721041
6 -0.193276  1.020094 -0.208693

**Calling fillna with a dict to pass different value for each column**

In [28]:
df.fillna({1:0.5,2:0})#to modify the existing object, use inplace=True

          0         1         2
0 -1.055807  0.500000  0.000000
1 -1.627519  0.500000  0.000000
2 -1.421884  0.500000  0.247866
3 -2.054681  0.500000 -1.126592
4 -1.109623  1.694152  2.155655
5 -1.034601  2.196093 -0.721041
6 -0.193276  1.020094 -0.208693

**Forward fill**

In [33]:
df1

          0         1         2
0  0.065756 -1.016631 -0.766389
1 -0.030237  0.765138 -0.061753
2 -1.604892       NaN  1.466834
3  0.116784       NaN  0.284640
4  0.195044       NaN       NaN
5  0.269647       NaN       NaN

In [34]:
df1.fillna(method='ffill')#can pass limit= argument to restrict the number of ffills

          0         1         2
0  0.065756 -1.016631 -0.766389
1 -0.030237  0.765138 -0.061753
2 -1.604892  0.765138  1.466834
3  0.116784  0.765138  0.284640
4  0.195044  0.765138  0.284640
5  0.269647  0.765138  0.284640

## 7.2 Data Transformation
**Removing Duplicates**

In [39]:
df2=pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})

In [40]:
df2

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

_duplicated_ **returns a boolean Series indicating whether**<br>
**each row is a duplicate(has been observed in the previous rows)**

In [41]:
df2.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

*drop_duplicates( )* **: Returns DateFrame where _duplicated_ array is false**

In [43]:
df2.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

**Enter the column name to specify the columns to consider**<br>
**By default keep the first observed value combination**<br>
**Pass** _keep='last'_ **will return the last one**

In [46]:
df2.drop_duplicates(['k1','k2'],keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

### Transforming Data Using Function or Mapping

In [48]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

**Add a column indicating the type of animal that each food came from**

In [58]:
meat_to_animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'honey ham':'pig',
    'nova lox':'salmon',
    'corned beef':'cow'
}

**str.lower( ) to convert each value to lower case**

In [52]:
lowercased=data['food'].str.lower()

In [53]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

_map_ **method on a Series accepts a function or a dict-like object**<br>
**containing a mapping**

In [54]:
data['animal']=lowercased.map(meat_to_animal)

In [55]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     NaN
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

**Or pass a lambda function**

In [59]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [60]:
data=pd.Series([1.,-999,2.,-999,-1000.,3.])

In [61]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

**Use** _replace=_ **to replace the null values**

In [62]:
data.replace(-999,np.nan)#use inplace=True to modify existing series

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [63]:
data.replace([-999,-1000],np.nan)#replace multiple values

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [65]:
data.replace([-999,-1000],[np.nan,0])#use different replacement for each value

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [66]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

**Renaming Axis Indexes**

In [72]:
data=pd.DataFrame(np.arange(12).reshape(3,4),index=['Ohio','Colorado','New York'],
                 columns=['one','two','three','four'])

In [73]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

**Capitalize the index, use map**

In [75]:
transform=lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

**Create a transformed version of a dataset without modifying**<br>
**the original**

In [77]:
data.rename(index=str.title,columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

**rename can be used in conjunction with a dict-like object**
**for a subset of the axis labels**

In [79]:
data.rename(index={'Ohio':'Indiana'}, columns={'two':'Two'})#can use inplace=True

          one  Two  three  four
Indiana     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

### Discretiization and Binning

In [80]:
age=[20,22,25,27,21,23,37,31,61,45,41,32]

**Divide into bins of distinct groups**

In [81]:
bins=[18,25,35,60,100]

In [82]:
cats=pd.cut(age,bins)#can change which side is open with right=False

**Returns a categorical object**

In [83]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

**Various Attributes**

In [84]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [85]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

**Return the bin counts**

In [88]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

**Label the bin names**

In [90]:
pd.cut(age,bins,labels=['Youth','Young Adult','Middle Aged','Senior'])

[Youth, Youth, Youth, Young Adult, Youth, ..., Young Adult, Senior, Middle Aged, Middle Aged, Young Adult]
Length: 12
Categories (4, object): [Youth < Young Adult < Middle Aged < Senior]

**Pass an integer number of bins to _cut_ will compute equal length bins**<br>
**based on the minimum and maximum values in the data**

In [91]:
data=np.random.randn(20)

In [92]:
pd.cut(data,4,precision=2)#precison=2 limits the decimal precision to two digits

[(-0.43, 0.73], (-1.6, -0.43], (1.9, 3.06], (0.73, 1.9], (0.73, 1.9], ..., (0.73, 1.9], (1.9, 3.06], (-0.43, 0.73], (-0.43, 0.73], (0.73, 1.9]]
Length: 20
Categories (4, interval[float64]): [(-1.6, -0.43] < (-0.43, 0.73] < (0.73, 1.9] < (1.9, 3.06]]

*qcut* **:Based in sample quantiles: obtain rougly equal sized bins**

In [93]:
data=np.random.rand(1000)#Nornally distributed

In [94]:
cats=pd.qcut(data,4)#cut into quartiles

In [95]:
cats

[(0.246, 0.506], (0.246, 0.506], (0.246, 0.506], (-0.00038, 0.246], (0.743, 1.0], ..., (0.246, 0.506], (0.246, 0.506], (0.743, 1.0], (0.743, 1.0], (0.743, 1.0]]
Length: 1000
Categories (4, interval[float64]): [(-0.00038, 0.246] < (0.246, 0.506] < (0.506, 0.743] < (0.743, 1.0]]

In [96]:
pd.value_counts(cats)

(0.743, 1.0]         250
(0.506, 0.743]       250
(0.246, 0.506]       250
(-0.00038, 0.246]    250
dtype: int64

_qcut_ **can pass own quantiles(numbers between 0 and 1,inclusive)**

In [97]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(0.0897, 0.506], (0.0897, 0.506], (0.0897, 0.506], (-0.00038, 0.0897], (0.914, 1.0], ..., (0.0897, 0.506], (0.0897, 0.506], (0.506, 0.914], (0.506, 0.914], (0.506, 0.914]]
Length: 1000
Categories (4, interval[float64]): [(-0.00038, 0.0897] < (0.0897, 0.506] < (0.506, 0.914] < (0.914, 1.0]]

### Detecting and Filtering Outliers

In [98]:
data=pd.DataFrame(np.random.rand(1000,4))

In [99]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.509178     0.502728     0.490359     0.486687
std       0.286374     0.292457     0.289131     0.285244
min       0.000616     0.000663     0.000065     0.000865
25%       0.269139     0.243939     0.236986     0.244963
50%       0.497383     0.507870     0.482472     0.497369
75%       0.762888     0.766555     0.748315     0.717773
max       0.999155     0.998567     0.999522     0.996805

**Find values in one of the columns exceeding 0.99 in absolute value**

In [100]:
col=data[2]

In [105]:
col[np.abs(col)>0.99]

352    0.998591
461    0.999242
705    0.996648
794    0.993525
826    0.999522
937    0.997458
Name: 2, dtype: float64

**Select all rows having absolute balue exceeding 0.999**<br>
**Use** _any_ **in boolean DataFrame**

In [107]:
data[np.abs(data>0.999).any(1)]

            0         1         2         3
461  0.722280  0.338849  0.999242  0.731994
721  0.999155  0.443814  0.482970  0.213935
826  0.111821  0.559140  0.999522  0.384269

**Set values based on certain criterias(cap values outside the interval to 0.999 or -0.999)**

In [110]:
data[np.abs(data>0.999).any(1)]=np.sign(data)*0.999
#np.sign(data) produces 1 and -1 values based on whether the values in the data are positive or negative

### Permutation and Random Sampling

In [111]:
df=pd.DataFrame(np.arange(5*4).reshape(5,4))

**Use** _permutation_ **with the length of the axis you want to permute produces an array of integers**

In [115]:
sampler=np.random.permutation(5)

**Applied to the DataFrame with iloc or equivalent take function**

In [116]:
df.iloc[sampler,:]

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [117]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

**Generate a subset with or without replacement**

In [118]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19

In [119]:
df.sample(n=3,replace=True)

   0  1   2   3
0  0  1   2   3
2  8  9  10  11
2  8  9  10  11

### Computing Indicator/Dummy Variables

In [121]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [122]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

**Use the built in** _get_dummies_ **function**

In [124]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

**Add a prefix to the columns in the indicator DataFrame**

In [125]:
dummies=pd.get_dummies(df['key'],prefix='key')

In [126]:
df_with_dummy=df[['data1']].join(dummies)

In [127]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

**Combine** _get_dummies_ **with a discretization function**

In [129]:
np.random.seed(12345)

In [130]:
values=np.random.randn(10)

In [131]:
values

array([-0.20470766,  0.47894334, -0.51943872, -0.5557303 ,  1.96578057,
        1.39340583,  0.09290788,  0.28174615,  0.76902257,  1.24643474])

In [ ]:
bins=[0,0.2,0.4,0.6,0.8,1]

In [133]:
pd.get_dummies(pd.cut(values,bins))

   (18, 25]  (25, 35]  (35, 60]  (60, 100]
0         0         0         0          0
1         0         0         0          0
2         0         0         0          0
3         0         0         0          0
4         0         0         0          0
5         0         0         0          0
6         0         0         0          0
7         0         0         0          0
8         0         0         0          0
9         0         0         0          0

## 7.3 String Manipulation

### String Object Methods

In [134]:
val='a,b,guido'

_split( )_ **can be broken into pieces**

In [135]:
val.split(',')

['a', 'b', 'guido']

_strip( )_ **can be used to trim whitespace**

In [138]:
pieces=[x.strip() for x in val.split(',')]

In [139]:
pieces

['a', 'b', 'guido']

_unpacking_ **and** _concatenation_

In [140]:
first,second,third=pieces

In [144]:
first+'::'+second+'::'+third

'a::b::guido'

**Equivalent way: pass a list to the** _join_ **method on the string** '::'

In [143]:
'::'.join(pieces)

'a::b::guido'

**Locating substring**

In [145]:
'guido' in val

True

In [146]:
val.index(',')

1

In [147]:
val.find(':')#index raises an exception if the string isn't found

-1

count **raises the number of occurences of a particular substring**

In [148]:
val.count(',')

2

replace **will substitue occurrences of one pattern for another**

In [149]:
val.replace(',','::')

'a::b::guido'

In [150]:
val.replace(',','')#pass empty string to delete patterns

'abguido'

### Regular Expressions

In [151]:
import re

In [152]:
text="foo        bar\t baz \tqux"

**Split a string with a variable number of whitespace characters(tabs, spaces,and newlines)**

In [153]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

**Equivalently complite the regex to form a reusable regex object**

In [154]:
regex=re.compile('\s+')

In [155]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

findall **:Get a list of all patterns matching the regex**

In [156]:
regex.findall(text)

['        ', '\t ', ' \t']

match **and** search <br>

In [157]:
text="""Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [158]:
pattern=r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [161]:
#re.IGNORECASE makes the regex case-insensitive
regex=re.compile(pattern,flags=re.IGNORECASE)

findall **returns all mathces**

In [162]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

search **returns a special match object**

In [165]:
m=regex.search(text)

In [166]:
m

In [168]:
text[m.start():m.end()]

'dave@google.com'

match **only mathces at the beginning of the string**

In [169]:
print(regex.match(text))

None

sub **will return a new string wih occurences of the pattern replaces by the new string**

In [172]:
print(regex.sub('Redacted',text))

Dave Redacted
Steve Redacted
Rob Redacted
Ryan Redacted

**Find all email addresses and simultaneously segement each adress into three components**<br>
**Use parentheses around the parts of the pattern to segment**

In [176]:
pattern=r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [185]:
regex=re.compile(pattern,flags=re.IGNORECASE)

In [188]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

sub **has access to groups in each match special symbols** \1 \2<br>
\1 **corresponds to the first matched group**

In [189]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## Vectorized String Functions in pandas

In [194]:
data=pd.Series(data)

**Series has array-oriented methods for string operation that skip NA values**<br>
**accessed through Series's** str **attribute**

In [195]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

**Regular expressions can be used, with any** re **options like** IGNORECASE

In [158]:
pattern=r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [196]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

**Vectorized element retrieval**

In [199]:
matches=data.str.findall(pattern,flags=re.IGNORECASE).str[0]

In [201]:
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [202]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [203]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

extract **method will retun the captured groups of a regular expression as a DataFrame**

In [205]:
data.str.extract(pattern,flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [206]:
%%bash
git status

On branch master
Your branch is up to date with 'origin/master'.

Changes not staged for commit:
  (use "git add/rm <file>..." to update what will be committed)
  (use "git restore <file>..." to discard changes in working directory)
	deleted:    .ipynb_checkpoints/Untitled-checkpoint.ipynb
	deleted:    .ipynb_checkpoints/Untitled1-checkpoint.ipynb
	modified:   Data_Loading_Practice.ipynb
	deleted:    Untitled.ipynb
	deleted:    Untitled1.ipynb

Untracked files:
  (use "git add <file>..." to include in what will be committed)
	.DS_Store
	.ipynb_checkpoints/Data_Loading_Practice-checkpoint.ipynb
	.ipynb_checkpoints/data_cleaning-checkpoint.ipynb
	.ipynb_checkpoints/practice1-checkpoint.ipynb
	data_cleaning.ipynb
	practice1.ipynb
	transaction.csv

no changes added to commit (use "git add" and/or "git commit -a")